# Housing Market

### Introduction:

This time we will create our own dataset with fictional numbers to describe a house market. As we are going to create random data don't try to reason of the numbers.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd
import numpy as np

### Step 2. Create 3 differents Series, each of length 100, as follows: 
1. The first a random number from 1 to 4 
2. The second a random number from 1 to 3
3. The third a random number from 10,000 to 30,000

In [2]:
first=pd.Series(np.random.randint(1,5,size=100))
second=pd.Series(np.random.randint(1,4,size=100))
third=pd.Series(np.random.randint(10000,30001,size=100))

### Step 3. Let's create a DataFrame by joinning the Series by column

In [3]:
df=pd.concat([first,second,third],axis=1)
df

    0  1      2
0   1  1  18121
1   2  3  12916
2   3  1  12190
3   2  3  12608
4   3  3  12880
.. .. ..    ...
95  4  2  12553
96  3  2  22437
97  1  1  24529
98  1  2  27796
99  2  3  12571

[100 rows x 3 columns]

### Step 4. Change the name of the columns to bedrs, bathrs, price_sqr_meter

In [4]:
df.columns=["bedrs","bathrs","price_sqr_meter"]
df

    bedrs  bathrs  price_sqr_meter
0       1       1            18121
1       2       3            12916
2       3       1            12190
3       2       3            12608
4       3       3            12880
..    ...     ...              ...
95      4       2            12553
96      3       2            22437
97      1       1            24529
98      1       2            27796
99      2       3            12571

[100 rows x 3 columns]

In [5]:
# Solution 2
df1=pd.concat([first,second,third],keys=("bedrs","bathrs","price_sqr_meter"),axis=1)
df1

    bedrs  bathrs  price_sqr_meter
0       1       1            18121
1       2       3            12916
2       3       1            12190
3       2       3            12608
4       3       3            12880
..    ...     ...              ...
95      4       2            12553
96      3       2            22437
97      1       1            24529
98      1       2            27796
99      2       3            12571

[100 rows x 3 columns]

### Step 5. Create a one column DataFrame with the values of the 3 Series and assign it to 'bigcolumn'

In [6]:
bigcolumn=pd.concat([first,second,third],axis=0)
bigcolumn=bigcolumn.to_frame()
bigcolumn

        0
0       1
1       2
2       3
3       2
4       3
..    ...
95  12553
96  22437
97  24529
98  27796
99  12571

[300 rows x 1 columns]

### Step 6. Oops, it seems it is going only until index 99. Is it true?

In [7]:
print(f'The highest index is: {bigcolumn.index.max()} , but the the table consist of: {len(bigcolumn)} observation')
if len(bigcolumn)>bigcolumn.index.max():
    print('so there are a problem in indexing')

The highest index is: 99 , but the the table consist of: 300 observation
so there are a problem in indexing

### Step 7. Reindex the DataFrame so it goes from 0 to 299

In [8]:
bigcolumn.reset_index(drop=True)

         0
0        1
1        2
2        3
3        2
4        3
..     ...
295  12553
296  22437
297  24529
298  27796
299  12571

[300 rows x 1 columns]